src/Catalogs/Свойства/Свойства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3707464-2a14-4985-bd92-b2906fe80703">
  <name>Свойства</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="88e0934d-f5b7-4d3b-a324-4f6c5b80407c">
    <name>ТипыСтрокой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9e441ff9-cd6f-45c0-a5a8-d6cefa01a348">
    <name>Синоним</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7f9fa1f0-0199-4658-9c43-8575de12ad99">
    <name>КвалификаторыСтроки_Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="89d50220-35f5-4f73-8942-4760660dba77">
    <name>КвалификаторыЧисла_Точность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea9570d1-cf27-4e71-b8a2-f1e06ae94a82">
    <name>КвалификаторыЧисла_Неотрицательное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b991c56-77fb-49ae-8497-7fb5d6407663">
    <name>КвалификаторыДаты_Состав</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cf3a7a6b-fc30-420a-81e1-04256ffec92a">
    <name>КвалификаторыЧисла_Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d4241a1f-7376-4978-a1eb-f250ed66f49d">
    <name>КвалификаторыСтроки_Фиксированная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7727b533-9762-4bdd-ae6f-c7bd22ad8be8">
    <name>Вид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>кфкИмяEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>кфкПроверкаЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="f50349b9-19fc-4f4a-8966-8a1aa8fc445c">
    <name>Типы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e3a1b3e7-3fea-4264-8c13-a0b13219e4b6">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Свойства/Forms/ФормаГруппы/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура кфкПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элемент = Элементы.Вставить("кфкИмяEN", Тип("ПолеФормы"), Элементы.ГруппаИдентификация, Элементы.Синоним);
	Элемент.ПутьКДанным = "Объект.кфкИмяEN";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	
	Элемент = Элементы.Вставить("кфкПроверкаЗаполнения", Тип("ПолеФормы"), , Элементы.ГруппаДополнительнаяИнформация);
	Элемент.ПутьКДанным = "Объект.кфкПроверкаЗаполнения";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

#КонецОбласти
